In [1]:
## Imports
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib as plt
#import pymysql
#from sqlalchemy import create_engine

In [2]:
# Fetch data, initial SQLization 
#db_connection_str = 'mysql+pymysql://deepanalytics:Sqltask1234!@34.73.222.197/deepanalytics'
#db_connection = create_engine(db_connection_str)
#df = pd.read_sql('SELECT * FROM credit', con=db_connection)
#df.to_csv('C2T1offline.csv')

In [3]:
# Since SQL server offline, using original CSV instead
data = pd.read_csv("C2T1-raworig-credit.csv")
print(data.columns)

Index(['MyUnknownColumn', 'X1', 'X2', 'X3', 'X4', 'X5', 'X6', 'X7', 'X8', 'X9',
       'X10', 'X11', 'X12', 'X13', 'X14', 'X15', 'X16', 'X17', 'X18', 'X19',
       'X20', 'X21', 'X22', 'X23', 'Y'],
      dtype='object')

In [4]:
data.describe()
data.info() ## 1 Fewer in the ID column -- 30203 vs 30204

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30204 entries, 0 to 30203
Data columns (total 25 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   MyUnknownColumn  30203 non-null  object
 1   X1               30204 non-null  object
 2   X2               30204 non-null  object
 3   X3               30204 non-null  object
 4   X4               30204 non-null  object
 5   X5               30204 non-null  object
 6   X6               30204 non-null  object
 7   X7               30204 non-null  object
 8   X8               30204 non-null  object
 9   X9               30204 non-null  object
 10  X10              30204 non-null  object
 11  X11              30204 non-null  object
 12  X12              30204 non-null  object
 13  X13              30204 non-null  object
 14  X14              30204 non-null  object
 15  X15              30204 non-null  object
 16  X16              30204 non-null  object
 17  X17              30204 non-null  object
 18  X18              30204 non-null  object
 19  X19              30204 non-null  object
 20  X20              30204 non-null  object
 21  X21              30204 non-null  object
 22  X22              30204 non-null  object
 23  X23              30204 non-null  object
 24  Y                30204 non-null  object
dtypes: object(25)
memory usage: 5.8+ MB

In [5]:
### Steps 
# # Change headers to be row 0 values
data.replace({'default payment next month':'def_next', 'PAY_0':'PAY_1'}, inplace=True)
data.columns = data.loc[0] ## Produces error if re-run this cell
data=data.drop([0]) ## Remove headers row record
print(data.info())
#print(data.head())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30203 entries, 1 to 30203
Data columns (total 25 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   ID         30202 non-null  object
 1   LIMIT_BAL  30203 non-null  object
 2   SEX        30203 non-null  object
 3   EDUCATION  30203 non-null  object
 4   MARRIAGE   30203 non-null  object
 5   AGE        30203 non-null  object
 6   PAY_1      30203 non-null  object
 7   PAY_2      30203 non-null  object
 8   PAY_3      30203 non-null  object
 9   PAY_4      30203 non-null  object
 10  PAY_5      30203 non-null  object
 11  PAY_6      30203 non-null  object
 12  BILL_AMT1  30203 non-null  object
 13  BILL_AMT2  30203 non-null  object
 14  BILL_AMT3  30203 non-null  object
 15  BILL_AMT4  30203 non-null  object
 16  BILL_AMT5  30203 non-null  object
 17  BILL_AMT6  30203 non-null  object
 18  PAY_AMT1   30203 non-null  object
 19  PAY_AMT2   30203 non-null  object
 20  PAY_AMT3   30203 non-null  object
 21  PAY_AMT4   30203 non-null  object
 22  PAY_AMT5   30203 non-null  object
 23  PAY_AMT6   30203 non-null  object
 24  def_next   30203 non-null  object
dtypes: object(25)
memory usage: 5.8+ MB
None

In [7]:
### Data cleanup

##Duplicates
duplicates=data[data.duplicated()]
print(duplicates) ## 201 records appear to be duplicate rows
data=data.drop_duplicates()
#print(data.duplicated().any()) ## Boolean confirmation duplicates removed

##Null values
print(data.isnull().sum()) ## Appears to be 1 null value within ID
nan_rows = data['ID'].isnull() 
print(nan_rows) ## Missing an ID, can we infer based on surrounding rows? 
print(data[200:205]) ## Appears row headers mistakenly left in throughout,not producing nan values

Empty DataFrame
Columns: [ID, LIMIT_BAL, SEX, EDUCATION, MARRIAGE, AGE, PAY_1, PAY_2, PAY_3, PAY_4, PAY_5, PAY_6, BILL_AMT1, BILL_AMT2, BILL_AMT3, BILL_AMT4, BILL_AMT5, BILL_AMT6, PAY_AMT1, PAY_AMT2, PAY_AMT3, PAY_AMT4, PAY_AMT5, PAY_AMT6, def_next]
Index: []

[0 rows x 25 columns]
0
ID           1
LIMIT_BAL    0
SEX          0
EDUCATION    0
MARRIAGE     0
AGE          0
PAY_1        0
PAY_2        0
PAY_3        0
PAY_4        0
PAY_5        0
PAY_6        0
BILL_AMT1    0
BILL_AMT2    0
BILL_AMT3    0
BILL_AMT4    0
BILL_AMT5    0
BILL_AMT6    0
PAY_AMT1     0
PAY_AMT2     0
PAY_AMT3     0
PAY_AMT4     0
PAY_AMT5     0
PAY_AMT6     0
def_next     0
dtype: int64
1        False
2        False
3        False
4        False
5        False
         ...
30199    False
30200    False
30201    False
30202    False
30203    False
Name: ID, Length: 30002, dtype: bool
0     ID  LIMIT_BAL     SEX        EDUCATION  MARRIAGE  AGE  PAY_1  PAY_2  \
201  201     180000  female  graduate school         1   38     -2     -2
202  NaN         X1      X2               X3        X4   X5     X6     X7
203   ID  LIMIT_BAL     SEX        EDUCATION  MARRIAGE  AGE  PAY_1  PAY_2
405  202     140000    male  graduate school         2   31      0      0
406  203     140000  female  graduate school         2   26     -1      0

0    PAY_3  PAY_4  ...  BILL_AMT4  BILL_AMT5  BILL_AMT6  PAY_AMT1  PAY_AMT2  \
201     -2     -2  ...          0          0          0         0         0
202     X8     X9  ...        X15        X16        X17       X18       X19
203  PAY_3  PAY_4  ...  BILL_AMT4  BILL_AMT5  BILL_AMT6  PAY_AMT1  PAY_AMT2
405      2      0  ...      20225      27407      10833     25000         0
406     -1     -1  ...       5818      13506        487     10000     13001

0    PAY_AMT3  PAY_AMT4  PAY_AMT5  PAY_AMT6     def_next
201         0         0         0         0  not default
202       X20       X21       X22       X23            Y
203  PAY_AMT3  PAY_AMT4  PAY_AMT5  PAY_AMT6     def_next
405      3000      7800         0      2500  not default
406      5841     13506       487      7004  not default

[5 rows x 25 columns]

In [10]:
## Locate all records with previous column headers
#rlist=data.sort_values('LIMIT_BAL', ascending=False)
#print(rlist.head(10)) ## 202 and 203
d2=data.dropna()
print(d2.shape)
#print(d2.iloc[201])
#d2.drop([201], inplace=True)

(30001, 25)

In [13]:
#d2 = d2.apply(pd.to_numeric) ## Produces error with record 200
print(d2.iloc[200:204]) ## Confirmed row header
d2=d2.drop([203])
#d2 = d2.apply(pd.to_numeric)
#nan_rows = d2[d2['ID'].isnull()] 
#print(nan_rows)
print(d2.shape)

0     ID  LIMIT_BAL     SEX        EDUCATION  MARRIAGE  AGE  PAY_1  PAY_2  \
201  201     180000  female  graduate school         1   38     -2     -2
203   ID  LIMIT_BAL     SEX        EDUCATION  MARRIAGE  AGE  PAY_1  PAY_2
405  202     140000    male  graduate school         2   31      0      0
406  203     140000  female  graduate school         2   26     -1      0

0    PAY_3  PAY_4  ...  BILL_AMT4  BILL_AMT5  BILL_AMT6  PAY_AMT1  PAY_AMT2  \
201     -2     -2  ...          0          0          0         0         0
203  PAY_3  PAY_4  ...  BILL_AMT4  BILL_AMT5  BILL_AMT6  PAY_AMT1  PAY_AMT2
405      2      0  ...      20225      27407      10833     25000         0
406     -1     -1  ...       5818      13506        487     10000     13001

0    PAY_AMT3  PAY_AMT4  PAY_AMT5  PAY_AMT6     def_next
201         0         0         0         0  not default
203  PAY_AMT3  PAY_AMT4  PAY_AMT5  PAY_AMT6     def_next
405      3000      7800         0      2500  not default
406      5841     13506       487      7004  not default

[4 rows x 25 columns]
(30000, 25)

In [14]:
## Save current version to new CSV file, reimport as int dtype

d2.to_csv('C2T1-Cleaned.csv')